02_CONF_FILES/03_ACCOMPLISHMENT_EXT/InformationRegisters/НастройкиОбменаRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаRMQ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиRMQ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиRMQ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

02_CONF_FILES/03_ACCOMPLISHMENT_EXT/InformationRegisters/НастройкиОбменаRMQ/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Фильтр = "Текстовый файл (*.txt)|*.txt";
	Диалог.Заголовок = "Выберитие файл с настройками соединения";
	Диалог.МножественныйВыбор = Ложь;
	
	ФайлНастроек = "";
	
	Если Диалог.Выбрать() Тогда
        ФайлНастроек = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
	Если ФайлНастроек = "" Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;       
	ТекстовыйДокумент.Прочитать(ФайлНастроек,КодировкаТекста.UTF8);
	
	НастройкиОбмена = Новый Структура;
	НастройкиОбмена.Вставить("Адрес"				,ТекстовыйДокумент.ПолучитьСтроку(1));
	НастройкиОбмена.Вставить("Порт"					,Число(ТекстовыйДокумент.ПолучитьСтроку(2)));
	НастройкиОбмена.Вставить("Логин"				,ТекстовыйДокумент.ПолучитьСтроку(3));
	НастройкиОбмена.Вставить("Пароль"				,ТекстовыйДокумент.ПолучитьСтроку(4));
	НастройкиОбмена.Вставить("Хост"					,ТекстовыйДокумент.ПолучитьСтроку(5));
	НастройкиОбмена.Вставить("Точка"				,ТекстовыйДокумент.ПолучитьСтроку(6));
	НастройкиОбмена.Вставить("Ключ"					,ТекстовыйДокумент.ПолучитьСтроку(7));
	НастройкиОбмена.Вставить("Очередь"				,ТекстовыйДокумент.ПолучитьСтроку(8));
	
	ЗагрузитьИзФайлаНаСервере(НастройкиОбмена);   
	
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(НастройкиОбмена)

	НаборЗаписей = РегистрыСведений.НастройкиОбменаRMQ.СоздатьНаборЗаписей();  

	Для каждого Настройка Из НастройкиОбмена Цикл
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Настройка 	= ПланыВидовХарактеристик.НастройкиRMQ.НайтиПоНаименованию(Настройка.Ключ); 
			НоваяЗапись.Значение 	= Настройка.Значение;	 
	
	КонецЦикла;  
	
	НаборЗаписей.Записать(Истина); 

КонецПроцедуры
